// ------------------------------ 1️⃣ السؤال الأول ------------------------------
//     - driving اسمها function عرف دالة او
//     - تأخذ عمر شخص (رقم) واذا كان اكبر من 18 تطبع
//          🚘😍 مبروك سوف تحصل على الليسن
//     - واذا كان اقل من 18 يطبع
//          😢 للاسف عمرك لا يسمح
//     console.log ، if ملاحظة: سوف تستخدم

// 👇 هنا function عرف الدالة او
function driving(age) {
    if (age>=18) {
       console.log("مبروك الليسن");
         
    }else{
    console.log( "للاسف لا ليسن "  );}
}

// لا تنسى أن تنادي الدالة

driving(20)
// ------------------------------ 2️⃣ السؤال الثاني ------------------------------
// 2️⃣ السؤال الثاني
//     - iceCream واجعل اسمها array عرف مصفوفة او
//     - 🍦 احفظ فيها مجموعة من نكهات الآيس كريم
//     - console.log لطباعة قائمة نكهات الآيس كريم بإستخدام for loop استخدم

// 👇 هنا array عرف المصفوفة او
let icecream =["مانجو" , "فراوله" , "كاكاو" , "كوكونات" ];

for (let index = 0; index < icecream.length; index++) {
    const element  = icecream[index];
    console.log(element)
}

    


// --------------------------------- ✨ بونص ------------------------------------
// بحيث عند مناداة الدالة تطبع القائمة myIceCream بإسم function عرف دالة او
// for loop عرف مصفوفة أخرى تحتوي على أفلامك الكرتون المفضلة بالنسبة لك وقم بطباعة الأفلام بإستخدام

// --------------------------------- 🔥 بونص ------------------------------------
// while loop اطبع احد المصفوفات بإستخدام
let carton =["هزيم-الرعد","ماوكلي","ريمي" ];


let namber = 0;

while (carton.length>namber) {
    console.log(carton[namber])
namber++;
}
